# -*- coding: utf-8 -*-
# დავალება 1
number = 12
# მიზანი: მიანიჭეთ რიცხვის ტიპი type() ფუნქციის ans1 ცვლადს
#დაწერეთ თქვენი კოდი აქ.
###################
ans1 = type(number)
###################
print(ans1)


# დავალება 2
price = "9.99"
# მიზანი: type casting -ის მეშვეობით გადაიყვანეთ price ცვლადი float-ად
#დაწერეთ თქვენი კოდი აქ.
###################
ans2 = float(price)
###################
print(ans2)


# დავალება 3
price1 = 9.99
# მიზანი: დააბეჭდინეთ კოდს დღევანდელი აქციის წინადადება.
#დაწერეთ თქვენი კოდი აქ.
###################
ans3 = f"იყიდეთ ფეხსაცმელი მხოლოდ {price1} ლარად"
###################
print(ans3)


# დავალება 4
a = 9.99
b = "0.01"
# მიზანი: დააბეჭდინეთ მათემატიკური გამოსახულება (ჯამი უნდა იყოს int-ი)
#დაწერეთ თქვენი კოდი აქ.
###################
ans4 = f"{a} + {b} = { int( a+float(b) ) }"
###################
print(ans4)




# დავალება 5
a = 9.99

b = "0.01"
# მიზანი: დააბეჭდინეთ კოდს დღევანდელი აქციის წინადადება (ჯამი უნდა იყოს int-ი)
# არ გამოიყენოთ string formating -ი 
# დაწერეთ თქვენი კოდი აქ.
###################
ans5 = str(a) + " + " + b + " = " + str( int( a + float(b)  ) )  
###################
print(ans5)